//=================================================
//
// [bulletmanager.cpp]
// Author:chikada shouya
//
//=================================================
#include "bulletmanager.h"

//=================================================
// 静的メンバ変数
//=================================================
CBullet* CBulletManager::m_pBullet[MAX_BULLET] = {};

//=================================================
// コンストラクタ
//=================================================
CBulletManager::CBulletManager()
{

}

//=================================================
// デストラクタ
//=================================================
CBulletManager::~CBulletManager()
{

}

//=================================================
// 初期化
//=================================================
HRESULT CBulletManager::Init(void)
{
	//m_pBullet[0] = CBullet::Create(D3DXVECTOR3(0.0f, 10.0f, 200.0f), D3DXVECTOR3(0.0f, 0.0f, 0.0f));
	return S_OK;
}

//=================================================
// 破棄
//=================================================
void CBulletManager::Uninit(void)
{
	for (int nCnt = 0; nCnt < MAX_BULLET; nCnt++)
	{
		if (m_pBullet[nCnt] == nullptr)return;
	}
}

//=================================================
// 更新
//=================================================
void CBulletManager::Update(void)
{
	for (int nCnt = 0; nCnt < MAX_BULLET; nCnt++)
	{
		if (m_pBullet[nCnt] == nullptr)return;
	}


}

//=================================================
// 描画
//=================================================
void CBulletManager::Draw(void)
{

}